---
type: LoadNature
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# LoadNature

`Autodesk.Revit.DB.Structure.LoadNature` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2016 | `public static LoadNature Create ( Document document , string name )` |
| Property | Parameter | — | `` |